rnavarro/openevse_esp32_firmware/src/net_manager.cpp
  switch (event)
  {
    case ARDUINO_EVENT_WIFI_AP_START:
    {
      if(WiFi.softAPsetHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.softAPgetHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_START:
    {
      if(WiFi.setHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.getHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
    {
      auto& src = info.wifi_sta_connected;
      WiFiEventStationModeConnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.channel = src.channel;
      wifiOnStationModeConnected(dst);
      WiFi.enableIpV6();  // Re-enable IPv6 after disconnect cleared it
    } break;

    case ARDUINO_EVENT_WIFI_STA_STOP:
    {
    } break;

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    {
      auto& src = info.wifi_sta_disconnected;
      WiFiEventStationModeDisconnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.reason = static_cast<WiFiDisconnectReason>(src.reason);
      wifiOnStationModeDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    {
      auto& src = info.got_ip.ip_info;
      WiFiEventStationModeGotIP dst;
      dst.ip = src.ip.addr;
      dst.mask = src.netmask.addr;
      dst.gw = src.gw.addr;
      wifiOnStationModeGotIP(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      esp_ip6_addr_type_t addr_type = esp_netif_ip6_get_addr_type(&addr);
      if (addr_type == ESP_IP6_ADDR_IS_LINK_LOCAL) {
        _ipv6address_linklocal = IPv6Address(addr.addr).toString();
        DEBUG.printf("Connected, WiFi IPv6 link-local: %s\r\n", _ipv6address_linklocal.c_str());
      } else if (addr_type == ESP_IP6_ADDR_IS_GLOBAL || addr_type == ESP_IP6_ADDR_IS_UNIQUE_LOCAL) {
        _ipv6address_global = IPv6Address(addr.addr).toString();
        DEBUG.printf("Connected, WiFi IPv6 global: %s\r\n", _ipv6address_global.c_str());
      }
      Mongoose.ipConfigChanged();
    } break;

    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    {
      auto& src = info.wifi_ap_staconnected;
      WiFiEventSoftAPModeStationConnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationConnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    {
      auto& src = info.wifi_ap_stadisconnected;
      WiFiEventSoftAPModeStationDisconnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_SCAN_DONE:
    {
      for(WiFiScanCompleteCallback callback : _scanCompleteCallbacks) {
        callback(info.wifi_scan_done.number);
      }

      _scanCompleteCallbacks.clear();
      WiFi.scanDelete();
    } break;
#ifdef ENABLE_WIRED_ETHERNET
    case ARDUINO_EVENT_ETH_START:
      DBUGF("ETH Started, link %s", ETH.linkUp() ? "up" : "down");
      if(ETH.linkUp())
      {
        //set eth hostname here
        if(ETH.setHostname(esp_hostname.c_str())) {
          DBUGF("Set host name to %s", ETH.getHostname());
        } else {
          DBUGF("Setting host name failed: %s", esp_hostname.c_str());
        }
      } else {
        wifiStartInternal();
      }
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      DBUGLN("ETH Connected");
      ETH.enableIpV6();  // Request IPv6 on ETH interface (v2.x API, uppercase V)
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      DBUG("ETH MAC: ");
      DBUG(ETH.macAddress());
      DBUG(", IPv4: ");
      DBUG(ETH.localIP());
      if (ETH.fullDuplex()) {
        DBUG(", FULL_DUPLEX");
      }
      DBUG(", ");
      DBUG(ETH.linkSpeed());
      DBUGLN("Mbps");
      haveNetworkConnection(ETH.localIP());
      _macaddress = ETH.macAddress();
      _ethConnected = true;
      wifiStop();
      break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      esp_ip6_addr_type_t addr_type = esp_netif_ip6_get_addr_type(&addr);
      if (addr_type == ESP_IP6_ADDR_IS_LINK_LOCAL) {
        _ipv6address_linklocal = IPv6Address(addr.addr).toString();
        DEBUG.printf("Connected, ETH IPv6 link-local: %s\r\n", _ipv6address_linklocal.c_str());
      } else if (addr_type == ESP_IP6_ADDR_IS_GLOBAL || addr_type == ESP_IP6_ADDR_IS_UNIQUE_LOCAL) {
        _ipv6address_global = IPv6Address(addr.addr).toString();
        DEBUG.printf("Connected, ETH IPv6 global: %s\r\n", _ipv6address_global.c_str());

        // Debug: verify ETH netif has global IPv6 after GOT_IP6
        esp_netif_t *eth_netif = esp_netif_get_handle_from_ifkey("ETH_DEF");
        if (eth_netif) {
          esp_ip6_addr_t ip6_gl;
          if (esp_netif_get_ip6_global(eth_netif, &ip6_gl) == ESP_OK) {
            DEBUG.printf("mDNS debug: ETH esp_netif_get_ip6_global after GOT_IP6: %s\r\n", IPv6Address(ip6_gl.addr).toString().c_str());
          } else {
            DEBUG.printf("mDNS debug: ETH esp_netif_get_ip6_global returned FAIL after GOT_IP6!\r\n");
          }
        }

        // Workaround for ESP-IDF v4.4 libmdns.a AAAA bug:
        // The precompiled mDNS library only calls esp_netif_get_ip6_linklocal()
        // (reads ip6_addr slot 0) when building AAAA responses. It never calls
        // esp_netif_get_ip6_global(). By swapping the global address into slot 0,
        // mDNS will advertise the global address instead of the link-local.
        esp_netif_t *swap_netif = esp_netif_get_handle_from_ifkey("ETH_DEF");
        if (swap_netif) {
          struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(swap_netif);
          if (lwip_nif &&
              ip6_addr_islinklocal(ip_2_ip6(&lwip_nif->ip6_addr[0])) &&
              !ip6_addr_isany(ip_2_ip6(&lwip_nif->ip6_addr[1])) &&
              !ip6_addr_islinklocal(ip_2_ip6(&lwip_nif->ip6_addr[1]))) {
            ip_addr_t tmp_addr = lwip_nif->ip6_addr[0];
            lwip_nif->ip6_addr[0] = lwip_nif->ip6_addr[1];
            lwip_nif->ip6_addr[1] = tmp_addr;
            u8_t tmp_state = lwip_nif->ip6_addr_state[0];
            lwip_nif->ip6_addr_state[0] = lwip_nif->ip6_addr_state[1];
            lwip_nif->ip6_addr_state[1] = tmp_state;
            u32_t tmp_valid = lwip_nif->ip6_addr_valid_life[0];
            lwip_nif->ip6_addr_valid_life[0] = lwip_nif->ip6_addr_valid_life[1];
            lwip_nif->ip6_addr_valid_life[1] = tmp_valid;
            u32_t tmp_pref = lwip_nif->ip6_addr_pref_life[0];
            lwip_nif->ip6_addr_pref_life[0] = lwip_nif->ip6_addr_pref_life[1];
            lwip_nif->ip6_addr_pref_life[1] = tmp_pref;
            DBUGF("IPv6: swapped link-local (slot 0) with global (slot 1) for mDNS AAAA");
          }
        }

        // Restart mDNS so it picks up the (now slot-0) global IPv6 address
        DEBUG.printf("mDNS: restarting to advertise global IPv6\r\n");
        mdns_free();
        if (mdns_init() == ESP_OK && mdns_hostname_set(esp_hostname.c_str()) == ESP_OK) {
          mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0);
          mdns_service_add(NULL, "_openevse", "_tcp", 80, NULL, 0);
          mdns_service_txt_item_set("_openevse", "_tcp", "type", buildenv.c_str());
          mdns_service_txt_item_set("_openevse", "_tcp", "version", currentfirmware.c_str());
          mdns_service_txt_item_set("_openevse", "_tcp", "id", ESPAL.getLongId().c_str());
          DEBUG.printf("mDNS: restarted with global IPv6\r\n");
        } else {
          DEBUG.printf("mDNS: restart FAILED\r\n");
        }
      }
      Mongoose.ipConfigChanged();
    } break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      DBUGLN("ETH Disconnected");
      _ethConnected = false;
      wifiStart();
      break;
    case ARDUINO_EVENT_ETH_STOP:
      DBUGLN("ETH Stopped");
      _ethConnected = false;
      break;
#endif
    default:
      break;
  }
}
#endif

void NetManagerTask::setup()
{
  DBUGLN("Starting Network Manager");

  // This is not really needed for our usecase on the ESP32, because random(n) uses theESP32 hardware random number
  // generator, but random() does not so safest to add some entropy here
  randomSeed(millis() | analogRead(RANDOM_SEED_CHANNEL));

